[
  {
    "url": "https://jaad.collinhaines.com",
    "type": "web",
    "title": "JAAD",
    "image": "jaad.png",
    "endDate": "",
    "startDate": "2016-08-30T00:00:00+00:00",
    "languages": "JavaScript, MongoDB",
    "frameworks": "Bootstrap, Meteor",
    "description": "Diving head first into more Meteor coding comes nothing more than just another admin dashboard. An admin dashboard template proposing how simplistic any team can view all important content in one location while still giving the user the option to view an item in detail; I'm not insane, I'm just a coder."
  },
  {
    "url": "http://contextual.xyz",
    "type": "web",
    "title": "ConTexutal",
    "image": "contextual.png",
    "endDate": "2016-05-06T00:00:00+00:00",
    "startDate": "2015-08-20T00:00:00+00:00",
    "languages": "JavaScript, MongoDB",
    "frameworks": "Bootstrap, Meteor",
    "description": "Grasping the wondrous concept of the mode-neutral pedagogy, ConTextual allows their students a one-of-a-kind platform access to four areas; self-instruction, student interaction, teacher interaction, and material learning. With this execution, one can only hope that students will have an easier time grasping the subject at hand rather than memorizing it.",
    "collaborators": "Kat Galang, Scott Hosley, Chris Ostrander"
  },
  {
    "url": "http://ravenel.cdh.sc.edu",
    "type": "web",
    "title": "Plants and Planter",
    "image": "ravenel.png",
    "endDate": "2016-04-29T00:00:00+00:00",
    "startDate": "2014-09-16T00:00:00+00:00",
    "languages": "PHP, JavaScript, MySQL",
    "frameworks": "Bootstrap",
    "description": "You'd be surprised how much time people had on their hands before machines. Henry William Ravenel was an 18<sup>th</sup>-century botanist living in South Carolina. Utilizing text transcriptions of his personal diaries and image scans of the actual botanical collection he owned, scholars, researchers, and students can come to a centralized showcasing website.",
    "collaborators": "Surya Bhatt, Carly Keith"
  }
]
